description/README.tex
% Created 2019-04-13 Sat 18:41
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Andrew Chen}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Andrew Chen},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{2nd Deliverable Update}
\label{sec:orgc256b8f}

\begin{enumerate}
\item The currently completed features are at the bottom of this file under the "Current App/Server Progress" sections
\item I have been pretty busy lately (with Senior Design, other classes, and whatnot), so my progress was slower than what was originally expected, but I finished a lot of the server requirements already.
\item Currently, on the application side, I have many of the Storyboard Screens prototyped already, so I just have to code the logic.
\item I have updated the timeline below to hopefully more accurately portray the expected completion of this project.
\end{enumerate}

\section{Project Description}
\label{sec:orgc6e8d16}

I plan to make a scheduling service application similar to doodle.com. The following sections will
describe the features and how I plan to implement the application on iOS.

\subsection{Critical Features}
\label{sec:org1c66637}

\begin{itemize}
\item Allow users to register/login and persist their session using JWT (JSON Web Tokens)
\item Allow users to copy/share a shareable key to join the meeting scheduler "room".
\item Allow users to see a calendar with timeslots that people are available on.
\item Will notify participants if all of the people who were invited all submitted their availabilities.
\item Allow all participants to vote on a meeting time if there is are multiple.
\item Will allow the winning timeslot to be added to the calendar
\end{itemize}

\subsection{Lower-priority Features}
\label{sec:org10cc877}

I will choose to do one or more of these features.

\begin{itemize}
\item Users can choose/vote on a map for meeting place.
\item In-room chat for notifying participants
\end{itemize}

\subsection{Critical Frameworks}
\label{sec:org983003b}

\begin{enumerate}
\item \textbf{AlamoFire}: for making network requests to a server.
\item \textbf{EventKit}: For accessing the calendar to add the event
\item \textbf{Starscream}: Websocket Library. Send room-specific information to server
\end{enumerate}

\subsection{Optional Frameworks}
\label{sec:org96b4f1d}

I'll be using one or more of these depending on what feature I plan to implement. 

\begin{enumerate}
\item \textbf{MapKit}: For displaying possible meeting locations (May not use this)
\item \textbf{MessageKit}: For the chat (May not use this)
\end{enumerate}


\subsection{Timeline}
\label{sec:orgbdeacf6}

\begin{center}
\begin{tabular}{ll}
Week & To do\\
\hline
Feb 25 & Idea accepted. Get initial server with test routes running.\\
Mar 04 & Continue working on API\\
Mar 11 & Draft application UI\\
Mar 18 & Start working on application\\
Mar 25 & Login/Registration functionality finished\\
Apr 01 & Working on Room Functionality\\
Apr 08 & Working on Connecting app to backend\\
Apr 15 & Work on optional additional features\\
Apr 22 & Finish up application\\
Apr 29 & Finishing touches to application\\
\end{tabular}
\end{center}

\subsection{Current App Progess}
\label{sec:org7c324f9}

\begin{center}
\begin{tabular}{ll}
Feature & Complete?\\
\hline
User Authentication & \\
User Registration & \\
Screen for displaying all rooms a user is a part of & \\
Create a new room & \\
Add other users to a room & \\
Common Calendar with All availabilities & \\
Add user availabilities & \\
Notify all users when everyone picked their availabilities & \\
Vote on best meeting time if there are multiple & \\
Export winning meeting time to apple calendar & \\
Calendar Component & yes\\
 & \\
\end{tabular}
\end{center}


\subsection{Current Server Progress}
\label{sec:orgae11473}

\begin{center}
\begin{tabular}{ll}
Feature & Complete?\\
\hline
User Authentication & yes\\
User Registration & yes\\
Create new room & yes\\
Add user to room & yes\\
Notify all members of room when everyone filled out their availabilities & \\
Protected Routes with JWT & yes\\
\end{tabular}
\end{center}


\subsection{Implementation Notes:}
\label{sec:org43b58ff}

\begin{enumerate}
\item The unique key to join a room can simply just be the rooms id. This is probably not the best, but in our case, this should suffice.
\end{enumerate}
\end{document}
